Practice Dataset: Titanic CSV

Exercise 1: Variables + Basic Types

In [3]:
import pandas as pd
df = pd.read_csv("/Users/darvikkunalbanda/DATA_ENGINEERING/cloud_learnings/data/titanic.csv")
df.head()

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0

In [4]:
#Creating Variable for pipeline config
host = "snowflake.company.com"
port = 443
warehouse = "COMPUTE_WH"
row_target = 891

In [6]:
print(type(host))
print(type(port))

<class 'str'>
<class 'int'>

In [7]:
print(f"Connecting to {host} : {port}")
print(f"Expect {row_target} rows")

Connecting to snowflake.company.com : 443
Expect 891 rows

Exercise 2: String Methods on Titanic Names

In [8]:
# Inspect messy names
print("Before : ")
print(df["name"].head())

Before :
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: name, dtype: object

In [10]:
#Clean : strip spaces + lowercase
df['clean_names'] = df["name"].str.strip().str.lower()
print("\n After: ")
print(df['clean_names'].head())

 After:
0                              braund, mr. owen harris
1    cumings, mrs. john bradley (florence briggs th...
2                               heikkinen, miss. laina
3         futrelle, mrs. jacques heath (lily may peel)
4                             allen, mr. william henry
Name: clean_names, dtype: object

In [22]:
# Check a specific row
messy = df["name"][0]
print(messy)
messy_lower = messy.strip().lower()
print(f"\n Messy : '{messy}' --> Clean : '{messy_lower}' ")
messy_proper = messy.title()
print(f"\n Messy : '{messy}' --> Clean : '{messy_proper}' ")

Braund, Mr. Owen Harris

 Messy : 'Braund, Mr. Owen Harris' --> Clean : 'braund, mr. owen harris'

 Messy : 'Braund, Mr. Owen Harris' --> Clean : 'Braund, Mr. Owen Harris'

Exercise 3: Quick Data Quality Check

In [26]:
# total rows
total_rows = len(df)
print(f"Total rows : {total_rows}")

#String type
names_null = df["name"].isnull().sum()
print(f"Null names: {names_null}")

# Conditional check
if total_rows == 891:
    print(" Data loaded successfully")
else:
    print("Row count missmatch!")

Total rows : 714
Null names: 0
Row count missmatch!